nc: 10

scales:
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024] # 默认

# AF-YOLO backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0
  - [-1, 1, Conv, [128, 3, 2]] # 1
  - [-1, 3, SCC2f, [128, True]] # 2
  - [-1, 1, Conv, [256, 3, 2]] # 3
  - [-1, 6, SCC2f, [256, True]] # 4
  - [-1, 1, Conv, [512, 3, 2]] # 5
  - [-1, 6, SCC2f, [512, True]] # 6
  - [-1, 1, SPPF, [512, 5]] # 7

# AF-YOLO PAFFN and head
head:
  - [[2, 4], 1, ASFF_2, [0]] # 8
  - [-1, 3, CRDR, [128]] # 9

  - [[2, 4], 1, ASFF_2, [1]] # 10
  - [-1, 3, CRDR, [256]] # 11

  - [[-3, -1, 7], 1, ASFF_3, [0]] # 12
  - [-1, 3, CRDR, [128]] # 13 160*

  - [[-5, -3, 7], 1, ASFF_3, [1]] # 14
  - [-1, 3, CRDR, [256]] # 15 80*

  - [[-7, -5, 7], 1, ASFF_3, [2]] # 16
  - [-1, 3, CRDR, [512]] # 17 40*

  - [[13, 15, 17], 1, Detect, [nc]] # DET(P2, P3, P4)
