nc: 10
scales:
  n: [0.33, 0.25, 1024]

backbone:
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, ScaleConsistencyCoupledSAEMNSRBRCSP, [32]]
  - [-1, 1, Conv, [256, 3, 2]] # 4-P3/8
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, ScaleConsistencyCoupledSAEMNSRBRCSP, [64]]
  - [-1, 1, Conv, [512, 3, 2]] # 7-P4/16
  - [-1, 6, C2f, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]] # 9-P5/32
  - [-1, 3, C2f, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]] # 11
  - [-1, 1, ScaleConsistencyCoupledSAEMNSRBRCSP, [256]]

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 8], 1, Concat, [1]]
  - [-1, 3, C2f, [512]] # 15

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 3, C2f, [256]] # 18 (P3/8)
  - [-1, 1, ScaleConsistencyCoupledSAEMNSRBRCSP, [64]]

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 3], 1, Concat, [1]]
  - [-1, 3, C2f, [128]] # 22 (P2/4)
  - [-1, 1, ScaleConsistencyCoupledSAEMNSRBRCSP, [32]]

  - [-1, 1, Conv, [128, 3, 2]]
  - [[-1, 19], 1, Concat, [1]]
  - [-1, 3, C2f, [256]] # 26 (P3/8)
  - [-1, 1, ScaleConsistencyCoupledSAEMNSRBRCSP, [64]]

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 15], 1, Concat, [1]]
  - [-1, 3, C2f, [512]] # 30 (P4/16)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 12], 1, Concat, [1]]
  - [-1, 3, C2f, [1024]] # 33 (P5/32)

  - [[23, 27, 30, 33], 1, Detect, [nc]]
